tests/benchmark_results_20260224T231228Z.txt
# httpd benchmark results
date_utc: 2026-02-24T23:13:13Z
hostname: a03012fe5faa
kernel: Linux 6.12.68-linuxkit aarch64 GNU/Linux
server_bin: /work/httpd
server_args: -p 28080 -t 4 -s /work/tests/static -i 10

## wrk GET /healthz
Running 15s test @ http://127.0.0.1:28080/healthz
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   645.01us  363.75us  16.44ms   89.57%
    Req/Sec    49.84k     6.31k  239.95k    95.25%
  Latency Distribution
     50%  591.00us
     75%  709.00us
     90%    0.88ms
     99%    2.12ms
  5957072 requests in 15.10s, 511.30MB read
Requests/sec: 394523.31
Transfer/sec:     33.86MB

## wrk GET /static/hello.txt
Running 15s test @ http://127.0.0.1:28080/static/hello.txt
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   743.22us  377.40us  11.34ms   92.21%
    Req/Sec    43.15k     6.61k  252.33k    96.92%
  Latency Distribution
     50%  706.00us
     75%  807.00us
     90%    0.97ms
     99%    1.73ms
  5156891 requests in 15.10s, 501.64MB read
  Socket errors: connect 0, read 0, write 0, timeout 15
Requests/sec: 341518.95
Transfer/sec:     33.22MB

## wrk POST /echo
Running 15s test @ http://127.0.0.1:28080/echo
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   676.25us  393.84us  12.23ms   90.28%
    Req/Sec    48.32k     4.20k   79.96k    74.83%
  Latency Distribution
     50%  612.00us
     75%  725.00us
     90%    0.93ms
     99%    2.53ms
  5772526 requests in 15.02s, 644.10MB read
Requests/sec: 384212.21
Transfer/sec:     42.87MB

## assertions
static_rps 341518.95
static_p99_ms 1.730
assert_static_rps_gte_75000 PASS
assert_static_p99_ms_lte_10 PASS

## /metrics snapshot
requests_total 16887058
requests_per_sec 373227.64
connections_current 1
bytes_in 1041719643
bytes_out 1737583467